print("โปรเเกรมรับค่าขนาดหน้าอก เพื่อทำการตรวจสอบของเสื้อโปโล โดยมีเงื่อนไขดังนี้")
print("    ถ้าขนาดหน้าอกไม่เกิน 34 จะได้เสื้อขนาด xs\n    ถ้าขนาดหน้าอกไม่เกิน 36 จะได้เสื้อขนาด s\n    ถ้าขนาดหน้าอกไม่เกิน 38 จะได้เสื้อขนาด M\n    ถ้าขนาดหน้าอกไม่เกิน 40 จะได้เสื้อขนาด L\n    ถ้าขนาดหน้าอกเกิน 40 จะได้เสื้อขนาด XL\n-------------------------------")
n = int(input("ระบุขนาดหน้าอกเพื่อระบุไซส์เสื้อของคุณ : "))
if(n<=34) :
    print("ขนาดไซส์ของคุณคือ Size xs")
elif(n<=36) :
    print("ขนาดไซส์ของคุณคือ Size s")
elif(n<=38) :
    print("ขนาดไซส์ของคุณคือ Size M")
elif(n<=40) :
    print("ขนาดไซส์ของคุณคือ Size L")
else :
    print("ขนาดไซส์ของคุณคือ Size XL")
print("--------------------------------------\n--------------------------------------")
print("กิจกรรมท้ายบท\n1.)โปรเเกรมสอบถามการทำบัตรเครดิต โดยต้องมีรายได้ 15000 บาท จึงจะทำบัตรเครดิตได้ โดยมีเงื่อนไขดังนี้")
print("    หากรายได้ตํ่ากว่า 70,000 บาท ทำบัตรเงิน\n    หากรายได้ตํ่ากว่า 100,000 บาท ทำบัตรทอง\n    หากรายได้มากกว่า 100,000 ทำบัตร Platinum\n--------------------------")
n = int(input("ระบุเงินเดือนของคุณ : "))
if(n<15000) :
    print("คุณไม่สามารถทำรายการได้")
elif(n<=70000) :
    print("คุณสามารถทำบัตรเงินได้")
elif(n<=100000) :
    print("คุณสามารถทำบัตรทองได้")
else :
    print("คุณสามารถทำบัตรPlatinumได้")
print("--------------------------------------\n--------------------------------------")
print("2.)โปรเเกรมคำนวนเกรด โดยมีเกณฑ์ดังนี้")
print("          ถ้าคะเเนนมากกว่าหรือเท่ากับ 80 ให้เท่ากับ A\n          ถ้าคะเเนนอยู่ในช่วง 70-79 ให้เท่ากับ B\n          ถ้าคะเเนนอยู่ในช่วง 60-69 ให้เท่ากับ C\n          ถ้าคะเเนนอยู่ในช่วง 50-59 ให้เท่ากับ D\n          ถ้าคะเเนนตํ่ากว่า 50 ให้เท่ากับ F\n--------------------------------------")
n = float(input("คะเเนนของคุณ"))
if(n>=80) :
    print("เกรด A")
elif(70<=n<80) :
    print("เกรด B")
elif(60<=n<70) :
    print("เกรด C")
elif(50<=n<60) :
    print("เกรด D")
else :
    print("เกรด F")
print("--------------------------------------\n--------------------------------------")
print("3.)เขียนโปรเเกรม Username เเละ Password เพื่อตรวจสอบว่า Admin หรือไม่ กำหนดให้")
print("          -Username คือ admin\n          -Password คือ Ad13n@23t\n--------------------------------------")
Admin_Username = "admin"
Admin_Password = "Ad13n@23t"
Username = input("Username : ")
Password = input("Password : ")
if(Admin_Username == Username and Admin_Password == Password) :
    print("Welcome, admin")
else :
    print("You are not admin")
print("--------------------------------------\n--------------------------------------")
print("3.) โปรเเกรมคำนวณค่า BMI\n  ซึ่ง Weight มีหน่วยเป็น Kg เเละ Height มีหน่วยเป็น m\n  BMI ที่ได้นั้นเป็นเช่นไรเทียบกับเกณฑ์ดังนี้")
print("     -Underweight เมื่อ BMI น้อยกว่า 18.5\n     -Normal weight เมื่อ BMI มีค่าตั้งเเต่ 18.5 เเต่ไม่ถึง 25\n     -Overweight เมื่อค่า BMI มีค่าตั้งเเต่ 25 เเต่ไม่ถึง 30\n     -Obesity เมื่อ BMI มีค่าไม่ตํ่ากว่า 30")
print("--------------------------------------")
W = float(input("กรุณากรอกนํ้าหนัก Weight(kg) : "))
H = float(input("กรุณากรอกส่วนสูง Height(m) : "))
BMI = W/H**2
print("--------------------------------------")
print("BMI is ", '%.2f' %(BMI))
if(BMI < 18.5) :
    print("Underweight")
elif(18.5<=BMI<25) :
    print("Normal weight")
elif(25<=BMI<30) :
    print("Overweight")
else :
    print("Obesity")
print("--------------------------------------")
print("-----------------------------END-----------------------------")
